{"title": "Culture | Elastic Blog", "body_content": "Skip to main content Platform Use cases Pricing Customers Resources Company Elastic Cloud Maximize value and optimize your experience Deploy everything Elastic has to offer across any cloud, in minutes. Learn more Additional Resources View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Boost conversions, lower bounce rates, and conquer abandoned shopping carts Download ebook Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Read more Contact Login Try free Platform Use cases Pricing Customers Resources Company Platform Featured Elastic Cloud View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team Use cases By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Customers Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Resources Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources Company About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Try free Have questions? Contact us Already have an account? Log in Blog Solutions Stack + Cloud Tech Topics News Customers Generative AI Culture Culture Learn more about what makes us who we are and meet Elasticians along the way. 7 tips for creating engaging employee events Creating events that employees actually want to engage in can be difficult, especially as a distributed company. Here, we share our secrets to employee event success. By Elastic Culture Someone Like Me: Moose Stevens believes you should show up exactly who you are “My experience as being queer at Elastic has been super positive,” Moose says. “Come as YOU, are is acted out. I’m quirky and can be myself, nobody cares.” By Moose Stevens Being one of the only women in her computer science program didn’t stop Hannah Mudge from pursuing her dream of becoming a software engineer Hannah had a love of tech from an early age. Now, she works on Elastic’s presentation team, focusing on Kibana and, more specifically, Dashboard. By Elastic Culture Elastic’s Courtney Wilburn on the 3 ways leaders can inspire their teams Courtney Wilburn's colleagues saw her management potential early on, but she focused on enhancing her programming skills to become a better contributor. She knew she had room to grow before advancing in her career. By Mara Calvello More on culture The Elastic Guide to: Getting your first tech job The time between graduating and starting your first job is an exciting — and overwhelming — time. Get advice from four Elasticians. By Elastic Culture 27 June 2023 Someone Like Me: Casey Zumwalt on building for customers and the keys to making a career switch Throughout Casey’s career, from product design to management to marketing, he’s cared about the same things — creating a great customer experience. By Elastic Culture 13 June 2023 Secrets to successful engineering leadership from Elastic’s Simona Posea For Simona Posea, visualizing a career in technology came easily. She found she loved learning basic algorithms and languages like C, so she decided to marry her passion with her career. By Sarah Lindauer 02 June 2023 ERGs encourage you to come as you are: Meet the Rainbow Stack June kicks off Pride season, which started in the U.S and is now celebrated worldwide. It’s an important time for our Rainbow Stack ERG, which welcomes everyone who identifies as LGBTQIA+ and their allies. By Elastic Culture 01 June 2023 Meet the Elasticians who work to make our products accessible to all We believe our products should be accessible by all who want to use them. Meet the people behind the scenes who work to make this happen. By Elastic Culture 18 May 2023 ERGs encourages you to come as you are: Meet the Accessibles The Accessibles work to raise awareness and create community at Elastic for those that are differently abled. Learn more about the group. By Elastic Culture 17 May 2023 4 tips to excel in technical support from Elastic's Julie Baxter-Rudd Elastic's Vice President of Global Customer Support, Julie Baxter-Rudd, got her start in technical support over two decades ago. By Sarah Lindauer 12 May 2023 Someone Like Me: Tristan Ma on celebrating his culture, connecting through ElastAsians, and building his sales career First generation can be interpreted in many ways. For Tristan Ma, Solutions Architect at Elastic, it means being the first generation to be born in the United States. Read about his career journey and how he celebrates his culture through food. By Elastic Culture 10 May 2023 ERGs encourage you to come as you are: Meet ElastAsians Employee resource groups, or Elastician resource groups as we call them, are groups within Elastic that are aligned with shared identities, experiences, interests, affinities, and allyships. By Elastic Culture 01 May 2023 View more posts Sign up for Elastic Cloud free trial Spin up a fully loaded deployment on the cloud provider you choose. As the company behind Elasticsearch , we bring our features and support to your Elastic clusters in the cloud. Start free trial Products & Solutions Search Observability Security Elastic Stack Elasticsearch Kibana Integrations Subscriptions Pricing Resources Documentation What is the ELK Stack? What is Elasticsearch? Migrating from Splunk OpenSearch vs. Elasticsearch Public Sector Company Careers Board of Directors Contact Follow us Follow us Language English Trademarks Terms of Use Privacy Sitemap © . Elasticsearch B.V. All Rights Reserved Elasticsearch is a trademark of Elasticsearch B.V., registered in the U.S. and in other countries. Apache, Apache Lucene, Apache Hadoop, Hadoop, HDFS and the yellow elephant logo are trademarks of the Apache Software Foundation in the United States and/or other countries. © . Elasticsearch B.V. All Rights Reserved", "links": ["https://www.elastic.co/", "https://www.elastic.co/blog/category/culture#main-content", "https://www.elastic.co/careers", "https://www.elastic.co/cloud", "https://www.elastic.co/cloud", "https://www.elastic.co/downloads", "https://www.elastic.co/elastic-stack", "https://www.elastic.co/enterprise-search", "https://www.elastic.co/explore/", "https://www.elastic.co/explore/devops-observability", "https://www.elastic.co/explore/improving-digital-customer-experiences", "https://www.elastic.co/explore/security-without-limits", "https://www.elastic.co/guide/index.html", "https://www.elastic.co/industries/financial-services", "https://www.elastic.co/industries/public-sector/", "https://www.elastic.co/industries/telecommunications", "https://www.elastic.co/integrations/data-integrations", "https://www.elastic.co/observability", "https://www.elastic.co/portfolio", "https://www.elastic.co/pricing", "https://www.elastic.co/pricing", "https://www.elastic.co/products", "https://www.elastic.co/security", "https://www.elastic.co/webinars/expert-tips-when-upgrading-elk-stack", "https://www.elastic.co/whats-new"], "headings": ["Maximize value and optimize your experience", "Search", "Observability", "Security", "Elastic Cloud", "Elastic (ELK) Stack", "Elastic 8.8 released", "Upgrade the Elastic Stack", "Documentation", "We're hiring", "Power of Elastic", "Improving digital customer experiences", "Evolving the DevOps lifecycle", "Security without limits", "Public Sector", "Financial Services", "Telecommunications", "Healthcare", "Technology", "Retail and Ecommerce", "Media and Entertainment", "Manufacturing and Automotive", "Secret ingredient for better website experience", "Getting started", "Support"], "last_crawled_at": "2023-07-25T08:23:28Z", "url": "https://www.elastic.co/blog/category/culture", "additional_urls": ["https://www.elastic.co/blog/category/culture"], "domains": ["https://www.elastic.co"], "url_scheme": "https", "url_host": "www.elastic.co", "url_port": "443", "url_path": "/blog/category/culture", "url_path_dir1": "blog", "url_path_dir2": "category", "url_path_dir3": "culture", "id": "64b935d1e761e31e7b47dc27", "passages": [" Skip to main content Platform Use cases Pricing Customers Resources Company Elastic Cloud Maximize value and optimize your experience Deploy everything Elastic has to offer across any cloud, in minutes. Learn more Additional Resources View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Boost conversions, lower bounce rates, and conquer abandoned shopping carts Download ebook Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions?", " Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Read more Contact Login Try free Platform Use cases Pricing Customers Resources Company Platform Featured Elastic Cloud View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team Use cases By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Customers Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Resources Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources Company About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Try free Have questions? Contact us Already have an account?", " Log in Blog Solutions Stack + Cloud Tech Topics News Customers Generative AI Culture Culture Learn more about what makes us who we are and meet Elasticians along the way. 7 tips for creating engaging employee events Creating events that employees actually want to engage in can be difficult, especially as a distributed company. Here, we share our secrets to employee event success. By Elastic Culture Someone Like Me: Moose Stevens believes you should show up exactly who you are “My experience as being queer at Elastic has been super positive,” Moose says. “Come as YOU, are is acted out. I’m quirky and can be myself, nobody cares.” By Moose Stevens Being one of the only women in her computer science program didn’t stop Hannah Mudge from pursuing her dream of becoming a software engineer Hannah had a love of tech from an early age. Now, she works on Elastic’s presentation team, focusing on Kibana and, more specifically, Dashboard. By Elastic Culture Elastic’s Courtney Wilburn on the 3 ways leaders can inspire their teams Courtney Wilburn's colleagues saw her management potential early on, but she focused on enhancing her programming skills to become a better contributor. She knew she had room to grow before advancing in her career. By Mara Calvello More on culture The Elastic Guide to: Getting your first tech job The time between graduating and starting your first job is an exciting — and overwhelming — time. Get advice from four Elasticians. By Elastic Culture 27 June 2023 Someone Like Me: Casey Zumwalt on building for customers and the keys to making a career switch Throughout Casey’s career, from product design to management to marketing, he’s cared about the same things — creating a great customer experience. By Elastic Culture 13 June 2023 Secrets to successful engineering leadership from Elastic’s Simona Posea For Simona Posea, visualizing a career in technology came easily. She found she loved learning basic algorithms and languages like C, so she decided to marry her passion with her career. By Sarah Lindauer 02 June 2023 ERGs encourage you to come as you are: Meet the Rainbow Stack June kicks off Pride season, which started in the U.S and is now celebrated worldwide. It’s an important time for our Rainbow Stack ERG, which welcomes everyone who identifies as LGBTQIA+ and their allies. By Elastic Culture 01 June 2023 Meet the Elasticians who work to make our products accessible to all We believe our products should be accessible by all who want to use them."]}
{"title": "Elastic continues to innovate and grow through Microsoft partnership | Elastic Blog", "body_content": "Skip to main content Platform Use cases Pricing Customers Resources Company Elastic Cloud Maximize value and optimize your experience Deploy everything Elastic has to offer across any cloud, in minutes. Learn more Additional Resources View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Boost conversions, lower bounce rates, and conquer abandoned shopping carts Download ebook Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Read more Contact Login Try free Platform Use cases Pricing Customers Resources Company Platform Featured Elastic Cloud View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team Use cases By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Customers Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Resources Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources Company About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Try free Have questions? Contact us Already have an account? Log in Blog Solutions Stack + Cloud Tech Topics News Customers Generative AI Culture Elastic continues to innovate and grow through Microsoft partnership By Brian Bergholm, Hemant Malik 18 May 2023 Share on Twitter Share on LinkedIn Share on Facebook Share by email Print From the beginning of our strategic alliance, Elastic and Microsoft have prioritized integrations that extend Elastic solutions across Microsoft Azure services. Our partnership is focused on helping you get more out of both your data and your infrastructure. Building momentum together In our blog a year ago , we highlighted how we have built an enhanced experience that makes it easier for you to bring in data from many different sources so you can transform data into actionable insights using native integration within the Azure portal . Our early innovation and collaboration in this area is now recognized as part of an official Microsoft service, which includes leading ISVs like Elastic: Azure Native ISV Service . What is Azure Native ISV Service? An Azure Native ISV Service enables you to easily provision, manage, and tightly integrate independent software vendor (ISV) software and services on Azure. Features include unified operations and several integrations — all designed to make your life easier. So what does this mean for you? Well, given these challenging economic times, this service gets you to value even faster. As outlined in our documentation , the Azure Native ISV Service for Elastic Cloud allows you to deploy managed instances of the Elastic Stack directly in Azure through the Azure integrated marketplace (aka the Azure console). As a result, you can more easily deploy managed Elastic Stack instances and consolidate your Azure logs in Elastic through a single-step setup. How could I benefit from Elastic Cloud on Azure? Our colleagues at Microsoft published a blog to help answer this question. However, if you’re still trying to determine how your organization could benefit from Elastic Cloud on Azure, we have a number of solutions that can help you with diverse challenges. With all the current industry buzz around generative AI, you might be interested to read how Mr. Turing , a leader in cognitive search, leveraged Elasticsearch on Azure to speed up results and lower costs. Another interesting example is Cranfield University in the UK. In order to do more with less, Cranfield migrated to Elastic Cloud running on Microsoft Azure. According to Network Specialist Luke Whitworth, \"Elastic Cloud on Microsoft Azure offers us a fast, scalable, and unified solution. We were able to take all our existing log management and put a SIEM layer on top very quickly. It's fast, flexible, and will quickly give us access to answers we need when responding to issues going forward.\" Want to solve a search issue? Take a look at this page . Trying to figure out how to ingest, view, and analyze your logs from your various applications? Look right here . Interested in ways to detect and respond to threats with SIEM? Peruse this primer . How do I start? We thought you’d never ask! We’ve built a Getting Started page to assist you through how to onboard as easily as possible. It’s full of helpful hints including Elastic on Microsoft Azure best practices. You’ll be glad you checked it out. Deploy anywhere worldwide and get started with Elastic Cloud on Azure today! Are you ready to transform endless data into endless possibilities with Elastic’s search-powered solutions? Get started today by signing up via Azure Marketplace and spin up a deployment in minutes on any of the 16 Elastic Cloud on Azure regions around the world. Additionally, your Azure Marketplace purchase of Elastic is included in your monthly consolidated billing statement and your investment in Elastic draws against your Microsoft Azure Consumption Commitment (MACC). The release and timing of any features or functionality described in this post remain at Elastic's sole discretion. Any features or functionality not currently available may not be delivered on time or at all. Share Share on Twitter Share on LinkedIn Share on Facebook Share by email Print Sign up for Elastic Cloud free trial Spin up a fully loaded deployment on the cloud provider you choose. As the company behind Elasticsearch , we bring our features and support to your Elastic clusters in the cloud. Start free trial Products & Solutions Search Observability Security Elastic Stack Elasticsearch Kibana Integrations Subscriptions Pricing Resources Documentation What is the ELK Stack? What is Elasticsearch? Migrating from Splunk OpenSearch vs. Elasticsearch Public Sector Company Careers Board of Directors Contact Follow us Follow us Language English Trademarks Terms of Use Privacy Sitemap © . Elasticsearch B.V. All Rights Reserved Elasticsearch is a trademark of Elasticsearch B.V., registered in the U.S. and in other countries. Apache, Apache Lucene, Apache Hadoop, Hadoop, HDFS and the yellow elephant logo are trademarks of the Apache Software Foundation in the United States and/or other countries. © . Elasticsearch B.V. All Rights Reserved", "links": ["https://www.elastic.co/", "https://www.elastic.co/blog/elastic-continues-to-innovate-and-grow-through-microsoft-partnership#main-content", "https://www.elastic.co/careers", "https://www.elastic.co/cloud", "https://www.elastic.co/cloud", "https://www.elastic.co/downloads", "https://www.elastic.co/elastic-stack", "https://www.elastic.co/enterprise-search", "https://www.elastic.co/explore/", "https://www.elastic.co/explore/devops-observability", "https://www.elastic.co/explore/improving-digital-customer-experiences", "https://www.elastic.co/explore/security-without-limits", "https://www.elastic.co/guide/index.html", "https://www.elastic.co/industries/financial-services", "https://www.elastic.co/industries/public-sector/", "https://www.elastic.co/industries/telecommunications", "https://www.elastic.co/integrations/data-integrations", "https://www.elastic.co/observability", "https://www.elastic.co/portfolio", "https://www.elastic.co/pricing", "https://www.elastic.co/pricing", "https://www.elastic.co/products", "https://www.elastic.co/security", "https://www.elastic.co/webinars/expert-tips-when-upgrading-elk-stack", "https://www.elastic.co/whats-new"], "headings": ["Maximize value and optimize your experience", "Search", "Observability", "Security", "Elastic Cloud", "Elastic (ELK) Stack", "Elastic 8.8 released", "Upgrade the Elastic Stack", "Documentation", "We're hiring", "Power of Elastic", "Improving digital customer experiences", "Evolving the DevOps lifecycle", "Security without limits", "Public Sector", "Financial Services", "Telecommunications", "Healthcare", "Technology", "Retail and Ecommerce", "Media and Entertainment", "Manufacturing and Automotive", "Secret ingredient for better website experience", "Getting started", "Support"], "last_crawled_at": "2023-07-25T08:23:29Z", "url": "https://www.elastic.co/blog/elastic-continues-to-innovate-and-grow-through-microsoft-partnership", "additional_urls": ["https://www.elastic.co/blog/elastic-continues-to-innovate-and-grow-through-microsoft-partnership"], "domains": ["https://www.elastic.co"], "url_scheme": "https", "url_host": "www.elastic.co", "url_port": "443", "url_path": "/blog/elastic-continues-to-innovate-and-grow-through-microsoft-partnership", "url_path_dir1": "blog", "url_path_dir2": "elastic-continues-to-innovate-and-grow-through-microsoft-partnership", "id": "64b935d1e761e3745a47dbdd", "passages": [" Skip to main content Platform Use cases Pricing Customers Resources Company Elastic Cloud Maximize value and optimize your experience Deploy everything Elastic has to offer across any cloud, in minutes. Learn more Additional Resources View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Boost conversions, lower bounce rates, and conquer abandoned shopping carts Download ebook Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions?", " Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Read more Contact Login Try free Platform Use cases Pricing Customers Resources Company Platform Featured Elastic Cloud View pricing Free trial and downloads View all integrations Use Elastic For Search Search and discovery experiences Observability Unified logs, metrics, and traces Security SIEM, endpoint, and cloud Elastic Cloud Deploy and scale in any cloud Elastic (ELK) Stack Elasticsearch, Kibana, and integrations View platform overview What's New Elastic 8.8 released See the latest enhancements Upgrade the Elastic Stack Expert tips when upgrading Documentation Read latest product guides We're hiring Join a global, distributed team Use cases By Topic Power of Elastic Improving digital customer experiences Evolving the DevOps lifecycle Security without limits View all topics By Industry Public Sector Financial Services Telecommunications Healthcare Technology Retail and Ecommerce Media and Entertainment Manufacturing and Automotive View all industries Featured Secret ingredient for better website experience Customers Stories By Use Case Search Search applications of all kinds Observability Logs, metrics, APM, and more Security SIEM, endpoint, cloud, and XDR Help Center Getting started Guidance to get started Support Get help and customer resources Contact us Have questions? Get in touch Featured Customers Cisco AI-powered search RWE Keeping traders trading Comcast Reduced cost of ownership View all success stories Resources Learn Documentation Product guides Blogs Tech topics, innovation, news Training Skill building and certification Engage Events ElasticON, meetups, virtual events Community Groups, forums, code Consulting Outcome-based services Featured Driving quantified success with Elastic Enterprise Search Get started with Elasticsearch Demo Gallery View all resources Company About Elastic About Our story and leadership Careers Peruse our opportunities Press Elastic news Partners Find or become a partner Investor Relations Results, filings, resources Elastic Excellence Awards See remarkable work Featured Why now is the time to move critical databases to the cloud Try free Have questions? Contact us Already have an account?", " Log in Blog Solutions Stack + Cloud Tech Topics News Customers Generative AI Culture Elastic continues to innovate and grow through Microsoft partnership By Brian Bergholm, Hemant Malik 18 May 2023 Share on Twitter Share on LinkedIn Share on Facebook Share by email Print From the beginning of our strategic alliance, Elastic and Microsoft have prioritized integrations that extend Elastic solutions across Microsoft Azure services. Our partnership is focused on helping you get more out of both your data and your infrastructure. Building momentum together In our blog a year ago , we highlighted how we have built an enhanced experience that makes it easier for you to bring in data from many different sources so you can transform data into actionable insights using native integration within the Azure portal . Our early innovation and collaboration in this area is now recognized as part of an official Microsoft service, which includes leading ISVs like Elastic: Azure Native ISV Service . What is Azure Native ISV Service? An Azure Native ISV Service enables you to easily provision, manage, and tightly integrate independent software vendor (ISV) software and services on Azure. Features include unified operations and several integrations — all designed to make your life easier. So what does this mean for you? Well, given these challenging economic times, this service gets you to value even faster. As outlined in our documentation , the Azure Native ISV Service for Elastic Cloud allows you to deploy managed instances of the Elastic Stack directly in Azure through the Azure integrated marketplace (aka the Azure console). As a result, you can more easily deploy managed Elastic Stack instances and consolidate your Azure logs in Elastic through a single-step setup. How could I benefit from Elastic Cloud on Azure? Our colleagues at Microsoft published a blog to help answer this question. However, if you’re still trying to determine how your organization could benefit from Elastic Cloud on Azure, we have a number of solutions that can help you with diverse challenges. With all the current industry buzz around generative AI, you might be interested to read how Mr. Turing , a leader in cognitive search, leveraged Elasticsearch on Azure to speed up results and lower costs. Another interesting example is Cranfield University in the UK. In order to do more with less, Cranfield migrated to Elastic Cloud running on Microsoft Azure. According to Network Specialist Luke Whitworth, \"Elastic Cloud on Microsoft Azure offers us a fast, scalable, and unified solution. We were able to take all our existing log management and put a SIEM layer on top very quickly."]}
